[{"commands_raw":"Hello, aren't you an intricate looking fella?\n\n?> who are you? -> choice number one node\n?> where am I? -> choice number two node","gnode_name":"start","id":0,"name":"start","position":[280,260]},{"commands_raw":"my name is Rasberyl, I have a sister called Tina, she's wayy less competent than me in managing trader goods, therefore I usually take care of all the deals\n\n?> \"...\" -> quest start","gnode_name":"choice number one node","id":1,"name":"choice number one node","position":[460,120]},{"commands_raw":"You're in Saintshade Town, a true misty nightmare with rolling fog, as you've noticed this town has a mystical quality. There's a church nearby and it is seen by the locals as a beacon through the mist, guiding both lost souls and wandering travelers to safety, or so they say at least, huehue.  \n\n?> are you a shopkeeper? -> shopkeeper ask\n?> church? -> church","gnode_name":"choice number two node","id":2,"name":"choice number two node","position":[440,340]},{"commands_raw":"If you want anything else just ask me, I can sell your crops and give you seeds, for a price of course!\n\n?> So lemme guess this straight I need to buy your seeds to help you? -> money question\n?> \"end conversation\" -> end ","gnode_name":"shop","id":3,"name":"shop","position":[1680,-20]},{"commands_raw":"Yes! If you ask me I pray all kinds of pranks on one of their members, her name is Mio.\n\n\n?> \"...\" -> church know","gnode_name":"church","id":4,"name":"church","position":[780,480]},{"commands_raw":"","gnode_name":"end","id":5,"name":"end","position":[2140,40]},{"commands_raw":"Either way there's a church nearby that has no idea how to raise crops, this is what happens when there's too big of a gap between lower and upperclass. With the lowerclass gone, nobody knows how to perform the job of a mere peasant, they have NO IDEA HOW TO MAKE FOOD!\n\n?> I can help out -> quest explain\n?> why don't you help them? -> quest ask","gnode_name":"quest start","id":6,"name":"quest start","position":[960,160]},{"commands_raw":"Really? If you're willing to help I can provide you with supplies to raise the crops, when you have given me enough berries I will take it back to the church, 10 berries will be enough\n\n?> I came here to escape from the city life, harvesting crops sound like a good idea -> shop\n?> you know I'm something of a farmer myself -> shop","gnode_name":"quest explain","id":7,"name":"quest explain","position":[1380,0]},{"commands_raw":"Me? Helping? Ehhmm, I also have no idea how to plant these things\n\n?> looks like I have no choice -> quest explain\n?> Fine I'll do it -> quest explain","gnode_name":"quest ask","id":8,"name":"quest ask","position":[1380,280]},{"commands_raw":"I would consider myself more like a wonderous traveller, I once managed to sell a crossbow for 1 copper coin, now that's what I call the art of the deal \n\n?> \"...\" -> quest start","gnode_name":"shopkeeper ask","id":9,"name":"shopkeeper ask","position":[720,260]},{"commands_raw":"Hey, we're all trying to make a living here, I once took my party members gold reward and divided it for myself and another guy, money doesn't grow on trees you know...\n\n?> \"end conversation\" -> end ","gnode_name":"money question","id":10,"name":"money question","position":[1900,-100]},{"commands_raw":"Either way that exact church is in a quite impredictable spot, they have no idea how to raise crops leading into a food shortage, I have some seeds but I need to find someone who knows how to plant and harvest them\n\n?> I'm willing to help -> quest explain\n?> why don't you help them? -> quest ask","gnode_name":"church know","id":11,"name":"church know","position":[1020,360]}]
